# Tasks

####
1.  Display Top 10 Rows of The Dataset
2. Check Last 10 Rows of The Dataset
3. Find Shape of Our Dataset (Number of Rows And Number of Columns)
4.  Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement
5. Check Null Values In The Dataset
6. Drop ID, Notes, Agency, and Status Columns
7. Get Overall Statistics About The Dataframe
8. Find Occurrence of The Employee Names  (Top 5)
9. Find The Number of Unique Job Titles
10. Total Number of Job Titles Contain Captain
11. Display All the Employee Names From Fire Department
12. Find Minimum, Maximum, and Average BasePay
13. Replace 'Not Provided' in all the Columns to NaN or NA
14. Check the Rows Having 4 Missing Values
15. Find Job Title of ALBERT PARDINI
16. How Much ALBERT PARDINI Make (Include Benefits)?
17. Display Name of The Person Having The Highest BasePay
18. Find Average BasePay of All Employee Per Year 
19. Find Average BasePay of All Employee Per JobTitle 
20. Find Average BasePay of Employee Having Job Title ACCOUNTANT  
21. Find Top 5 Most Common Jobs

In [1]:
import pandas as pd

#### Q1

In [2]:
df = pd.read_csv(r"C:\Users\sahil\Pandas_analysis\Salaries.csv")
df.head(10)

C:\Users\sahil\AppData\Local\Temp\ipykernel_14512\343807813.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(r"C:\Users\sahil\Pandas_analysis\Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

#### Q2

In [5]:
df.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

#### Q3

In [8]:
print('Number of Rows:',df.shape[0])
print('Number of Columns', df.shape[1])

Number of Rows: 148654
Number of Columns 13

#### Q4

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

#### Q5

In [12]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

#### Q6

In [17]:
df.drop(columns=['Id','Notes', 'Agency', 'Status'], inplace=True)

In [18]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [19]:
df.shape

(148654, 9)

#### Q7

In [22]:
df.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

#### Q8

In [23]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [25]:
df.value_counts('EmployeeName').head(5)

EmployeeName
Kevin Lee       13
Steven Lee      11
William Wong    11
Richard Lee     11
John Chan        9
Name: count, dtype: int64

#### Q9

In [26]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [32]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], shape=(2159,), dtype=object)

In [33]:
df['JobTitle'].nunique()

2159

#### Q10

In [42]:
len(df[df['JobTitle'].str.contains('Captain', case=False)])

552

#### Q11

In [43]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [52]:
df[df['JobTitle'].str.contains('Fire', case=False)] [['EmployeeName']]

              EmployeeName
4          PATRICK GARDNER
6                ALSON LEE
8           MICHAEL MORRIS
9       JOANNE HAYES-WHITE
10           ARTHUR KENNEY
...                    ...
145956    Kenneth C Farris
147556       Edward A Dunn
148021      Kari A Johnson
148209        Sheryl K Lee
148554     Lawrence F Gatt

[5879 rows x 1 columns]

#### Q12

In [53]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [62]:
df['BasePay'].describe()

count     148049.0
unique    109900.0
top            0.0
freq         875.0
Name: BasePay, dtype: float64

In [64]:
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148654 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148045 non-null  float64
 3   OvertimePay       148654 non-null  object
 4   OtherPay          148654 non-null  object
 5   Benefits          112495 non-null  object
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
dtypes: float64(3), int64(1), object(5)
memory usage: 10.2+ MB

In [66]:
df['BasePay'].describe()

count    148045.000000
mean      66325.448840
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

#### Q13

In [95]:
not_prov = df.columns[df.apply(lambda x: x.astype(str).str.contains('not provided', case=False, na=False)).any()]
print(not_prov)

Index(['JobTitle', 'OvertimePay', 'OtherPay', 'Benefits'], dtype='object')

In [97]:
a = ['JobTitle', 'OvertimePay', 'OtherPay', 'Benefits']
df[a] = df[a].apply(lambda x: x.str.lower().replace('not provided', pd.NA))
df[a]

,JobTitle,OvertimePay,OtherPay,Benefits
0,general manager-metropolitan transit authority,NaN,NaN,NaN
1,captain iii (police department),NaN,NaN,NaN
2,captain iii (police department),NaN,NaN,NaN
3,wire rope cable maintenance mechanic,NaN,NaN,NaN
4,"deputy chief of department,(fire department)",NaN,NaN,NaN
...,...,...,...,...
148649,custodian,0.00,0.00,0.00
148650,<NA>,<NA>,<NA>,<NA>
148651,<NA>,<NA>,<NA>,<NA>
148652,<NA>,<NA>,<NA>,<NA>
148653,"counselor, log cabin ranch",0.00,-618.13,0.00

In [99]:
df.isnull().sum()

EmployeeName             6
JobTitle                 4
BasePay                609
OvertimePay         131076
OtherPay            131076
Benefits            131076
TotalPay                 0
TotalPayBenefits         0
Year                     0
dtype: int64

In [113]:
df[df['OvertimePay'].isna()].head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,nathaniel ford,general manager-metropolitan transit authority,167411.18,NaN,NaN,NaN,567595.43,567595.43,2011
1,gary jimenez,captain iii (police department),155966.02,NaN,NaN,NaN,538909.28,538909.28,2011
2,albert pardini,captain iii (police department),212739.13,NaN,NaN,NaN,335279.91,335279.91,2011
3,christopher chong,wire rope cable maintenance mechanic,77916.00,NaN,NaN,NaN,332343.61,332343.61,2011
4,patrick gardner,"deputy chief of department,(fire department)",134401.60,NaN,NaN,NaN,326373.19,326373.19,2011

In [109]:
len(df[df['OvertimePay'].isna()])

131076

#### Q14

In [104]:
df[df.isnull().sum(axis=1)==4]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
13797,<NA>,public safety communications dispatcher,57963.39,NaN,NaN,NaN,82021.16,82021.16,2011
44151,<NA>,public safetycomm disp,82196.52,NaN,NaN,NaN,111883.21,149907.51,2012
81391,kevin p cashman,deputy chief 3,NaN,NaN,NaN,NaN,149934.11,149934.11,2013
84506,demetrya mullens,licensed vocational nurse,NaN,NaN,NaN,NaN,110485.41,131264.41,2013
84960,michael m horan,park patrol officer,NaN,NaN,NaN,NaN,120000.00,128841.48,2013
...,...,...,...,...,...,...,...,...,...
110526,arthur l curry,ps aide health services,NaN,NaN,NaN,NaN,10.67,10.67,2013
110527,nereida vega,senior clerk,NaN,NaN,NaN,NaN,5.56,5.56,2013
110528,timothy e gibson,police officer 3,NaN,NaN,NaN,NaN,0.00,-2.73,2013
110529,mark e laherty,police officer 3,NaN,NaN,NaN,NaN,0.00,-8.20,2013
110530,david p kucia,police officer 3,NaN,NaN,NaN,NaN,0.00,-33.89,2013

In [115]:
len(df[df.isnull().sum(axis=1)==4])

607

#### Q15

In [117]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [126]:
df[df['EmployeeName'].str.upper()=='ALBERT PARDINI'] [['JobTitle']]

                              JobTitle
2      captain iii (police department)
36519                        captain 3

#### Q16

In [3]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [5]:
df[df['EmployeeName'].str.upper()=='ALBERT PARDINI'] [['TotalPayBenefits']]

       TotalPayBenefits
2             335279.91
36519         253995.29

#### Q17

In [11]:
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')

In [18]:
df[df['BasePay'] ==  df['BasePay'].max()] [['EmployeeName']]

         EmployeeName
72925  Gregory P Suhr

#### Q18

In [22]:
df['BasePay'].dtype

dtype('float64')

In [20]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [23]:
df.groupby('Year')[['BasePay']].mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

#### Q19

In [24]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [25]:
df.groupby('JobTitle')[['BasePay']].mean()

                                                     BasePay
JobTitle
ACCOUNT CLERK                                   43300.806506
ACCOUNTANT                                      46643.172000
ACCOUNTANT INTERN                               28732.663958
ACPO,JuvP, Juv Prob (SFERS)                     62290.780000
ACUPUNCTURIST                                   66374.400000
...                                                      ...
X-RAY LABORATORY AIDE                           47664.773077
X-Ray Laboratory Aide                           46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS  52609.910000
Youth Comm Advisor                              39077.957500
ZOO CURATOR                                     43148.000000

[2159 rows x 1 columns]

#### Q20

In [26]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [29]:
df[df['JobTitle'].str.lower()=='accountant'] [['BasePay']].mean()

BasePay    46643.172
dtype: float64

#### Q21

In [30]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [31]:
df['JobTitle'].value_counts().head()

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64